package Facebook;

/**
 * 
 * 没有寒暄，直接做题。题目是面经里常见的稀疏向量乘积，分两部分写，先用某数据结构保存，再算乘积。
很遗憾，这个面经一面之前我没看过，所以是现场写的，面试官全程冷淡，写完让我run test，是真的跑了。。。按照他的要求，我最后写了五个test case，还真的发现一个bug，我自己改了过来。这期间他依然是不怎么管我，感觉在干别的事情。。。
此时还剩快二十分钟，他看我弄好了，就来问follow up，先是时空复杂度，然后你的方法可以怎么提高，最后问用改用map存好不好（我用的list存），我觉得时间复杂度一样啊，然后他就笑了，说了怎么不好，说了一通，我也没听明白。

第二道是今年被玩了很多次的西蜀橘臻乘法，我之前没仔细看大家的面筋，用的UNordered map，用value作为key，白人格格很热心的给了提示用vector<pair<int,int>>，后来时间不太够了。只说了想法。.鏈

 * @author Shengyi
 *
 */

public class _01_sparce_matrix {

}
